tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "olets/tap"
brew "webp"
brew "ast-grep"
brew "aws-sso-util"
brew "awscli"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "glib"
brew "cairo"
brew "ccache"
brew "chezmoi"
brew "dust"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "libmicrohttpd"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gibo"
brew "git"
brew "git-lfs"
brew "go"
brew "librsvg"
brew "graphviz"
brew "hyperfine"
brew "icu4c@76"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "mecab"
brew "mecab-ipadic"
brew "mise"
brew "pkgconf"
brew "poppler"
brew "postgresql@15"
brew "protobuf@3"
brew "ripgrep"
brew "scrcpy"
brew "sheldon"
brew "tig"
brew "tree"
brew "watchman"
brew "zoxide"
brew "olets/tap/zsh-abbr"
cask "android-platform-tools"
cask "android-studio"
cask "chromedriver"
cask "cleanshot"
cask "cursor"
cask "figma"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "microsoft-edge"
cask "notion"
cask "orbstack"
cask "postman"
cask "raycast"
cask "rectangle"
cask "slack"
cask "tableplus"
cask "warp"
cask "zed"
cask "zoom"
cask "zulu@17"
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Tailscale", id: 1475387142
vscode "anthropic.claude-code"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
