tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "bat"
brew "chezmoi"
brew "direnv"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "nodenv"
brew "rbenv"
brew "tig"
brew "tmux"
brew "zoxide"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "rectangle"
cask "visual-studio-code"
cask "warp"
vscode "alanz.vscode-hie-server"
vscode "alefragnani.project-manager"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "be5invis.toml"
vscode "bierner.folder-source-actions"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "cschlosser.doxdocgen"
vscode "dariofuzinato.vue-peek"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "eg2.vscode-npm-script"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hollowtree.vue-snippets"
vscode "ICS.japanese-proofreading"
vscode "JannisX11.batch-rename-extension"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jock.svg"
vscode "justusadam.language-haskell"
vscode "k--kato.intellij-idea-keybindings"
vscode "kdcro101.favorites"
vscode "kimuson.ts-type-expand"
vscode "mathiasfrohlich.Kotlin"
vscode "mattn.Lisp"
vscode "mgmcdermott.vscode-language-babel"
vscode "mitaki28.vscode-clang"
vscode "mksafi.simple-autocomplete"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mubaidr.vuejs-extension-pack"
vscode "naco-siren.gradle-language"
vscode "naumovs.color-highlight"
vscode "octref.vetur"
vscode "OfHumanBondage.react-proptypes-intellisense"
vscode "Orta.vscode-jest"
vscode "paulmolluzzo.convert-css-in-js"
vscode "pflannery.vscode-versionlens"
vscode "phind.phind"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "robertoachar.vscode-essentials-snippets"
vscode "RoscoP.ActiveFileInStatusBar"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.annotator"
vscode "sdras.vue-vscode-snippets"
vscode "shardulm94.trailing-spaces"
vscode "skyapps.fish-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "sysoev.language-stylus"
vscode "thisismanta.stylus-supremacy"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
vscode "xabikos.JavaScriptSnippets"
vscode "xyz.local-history"
vscode "ZixuanChen.vitest-explorer"
