tap "708u/tap"
tap "coderabbitai/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "km-tr/tap"
tap "manaflow-ai/cmux"
tap "olets/tap"
tap "productdevbook/tap"
tap "satococoa/tap"
tap "steipete/tap"
brew "webp"
brew "ast-grep"
brew "aws-sso-util"
brew "awscli"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "glib"
brew "cairo"
brew "ccache"
brew "chezmoi"
brew "cloudflared"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "gnutls"
brew "go"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hyperfine"
brew "icu4c@76"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "libass"
brew "libmicrohttpd"
brew "libpq"
brew "llm"
brew "mas"
brew "mecab"
brew "mecab-ipadic"
brew "mise"
brew "ollama", restart_service: :changed
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "postgresql@15"
brew "proj"
brew "protobuf@3"
brew "resvg"
brew "ripgrep"
brew "rsync"
brew "scooter"
brew "scrcpy"
brew "sentry-cli"
brew "sevenzip"
brew "sheldon"
brew "tesseract"
brew "tig"
brew "tmux"
brew "tree"
brew "uv"
brew "watchman"
brew "yazi"
brew "zoxide"
brew "coderabbitai/tap/git-gtr"
brew "km-tr/tap/worktree-link"
brew "olets/tap/zsh-abbr"
brew "satococoa/tap/wtp"
cask "android-platform-tools"
cask "android-studio"
cask "708u/tap/cctidy"
cask "claude"
cask "cleanshot"
cask "manaflow-ai/cmux/cmux"
cask "steipete/tap/codexbar"
cask "copilot-cli"
cask "cursor"
cask "figma"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "microsoft-edge"
cask "ngrok"
cask "notion"
cask "orbstack"
cask "productdevbook/tap/portkiller"
cask "postman"
cask "raycast"
cask "rectangle"
cask "slack"
cask "tableplus"
cask "708u/tap/twig"
cask "warp"
cask "wezterm"
cask "zed"
cask "zoom"
cask "zulu@17"
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
cargo "cargo-dist"
cargo "cargo-release"
